Revit 2024 API
ModuleStatus Enumeration
 The Macro module status.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Since: 2014
Syntax
C#
public enum ModuleStatus
Visual Basic
Public Enumeration ModuleStatus
Visual C++
public enum class ModuleStatus
Members
Member name | Description
Loaded |  The module is loaded.
BuildFailed |  Failed to build the module.
LoadFailed |  Failed to load the module.
Disabled |  The module is disabled.
Corrupt |  The module is corrupt.
NotBuild |  The module is not build.
See Also
Autodesk.Revit.DB.Macros Namespace